резерв/Catalogs/Товар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Товар</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Тип</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

резерв/Enums/Тип.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>Тип</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Питание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

резерв/Catalogs/Товар/Forms/ФормаЭлемента1/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда 
		Фото = ПутьФайла;
		УстановитьКартинку();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()
	НовыйФайлКартинки = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
	НовыйФайлКартинки.Записать();
	Объект.Картинка = НовыйФайлКартинки.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Перем ТекстСообщения;
	ТекстСообщения = "";
	Если ПустаяСтрока(Объект.Название) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Название";
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстСообщения) Тогда 
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Объект.Наименование = Объект.Название;
КонецПроцедуры

&НаКлиенте
Процедура ТипТовараПриИзменении(Элемент)
	ТипТовараПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ТипТовараПриИзмененииНаСервере()
	Если Объект.ТипТовара = Перечисления.Тип.Питание Тогда
		ЭтаФорма.Элементы.СрокГодности.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.СрокГодности.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
